case_up_half_cube_28/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.001);

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    top
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    bottom
    {
        type            noSlip;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    walls
    {
        type            noSlip;
    }
    source
    {
        // Single-stage ramp: 0 → 1290 m/s over 0.65 s (slope = 1985 m/s²).
        // 1290 m/s ≈ sonic speed for H2 at 286 K (Ma ≈ 1.0).
        // Nozzle: 31.6 mm square (same as case 23 — STL copied from case 23).
        // k and epsilon are synchronised explicit tables in 0.orig/k and 0.orig/epsilon.
        type            uniformFixedValue;
        uniformValue    table
        (
            (0.0    (0 0 0))
            (0.65   (0 0 1290))
            (100.0  (0 0 1290))
        );
        value           uniform (0 0 0);
    }
    nozzle_wall_rest
    {
        type            noSlip;
    }
}


// ************************************************************************* //
