case_up_half_cube_28/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// ────────────────────────────────────────────────
// USER PARAMETERS FOR EASY ADJUSTMENT
// ────────────────────────────────────────────────
//
// Quarter domain: symmetryPlane at x=0 (left) AND y=0 (front).
// The nozzle sits at (x=0, y=0, z=1.02) — on both symmetry planes.

x_min        0.0;      // symmetry plane (left)
x_max        14.0;     // overall domain max x  (4 m external buffer beyond x_fine_max=10)
y_min        0.0;      // symmetry plane (front) — was -10.0 in half-domain
y_max        10.0;     // overall domain max y  (4 m external buffer beyond y_fine_max=6)
z_min        0.0;      // overall domain min z
z_max        12.0;     // overall domain max z  (4 m external buffer beyond z_fine_max=8)

dx_fine      0.5;     // desired cell size in fine region [m]

x_fine_min   0.0;      // must match x_min
x_fine_max   10.0;
y_fine_min   0.0;      // must match y_min (no coarse layer on symmetry side)
y_fine_max   6.0;
z_fine_min   0.0;      // must match z_min
z_fine_max   8.0;

expansion    1.5;      // grading factor (expansion toward boundaries)
expInv       #calc "1.0/$expansion";

// ────────────────────────────────────────────────
// Derived quantities
// ────────────────────────────────────────────────

xlen_fine    #calc "$x_fine_max - $x_fine_min";
ylen_fine    #calc "$y_fine_max - $y_fine_min";
zlen_fine    #calc "$z_fine_max - $z_fine_min";

nx_fine      #calc "round($xlen_fine / $dx_fine)";
ny_fine      #calc "round($ylen_fine / $dx_fine)";  // = 12 (was 24 in half-domain)
nz_fine      #calc "round($zlen_fine / $dx_fine)";

nx_coarse    4;       // cells in x-coarse region
ny_coarse    4;       // cells in y-coarse region (y_fine_max to y_max)
nz_coarse    4;       // cells in z-coarse region

// ────────────────────────────────────────────────
// VERTICES (0–26): 3 x-positions × 3 y-positions × 3 z-positions
//
//   x: x_min=0  x_fine_max=10  x_max=14
//   y: y_min=0  y_fine_max=6   y_max=10
//   z: z_min=0  z_fine_max=8   z_max=12
// ────────────────────────────────────────────────
vertices
(
    // z = z_min (bottom plane)
    ($x_min      $y_min      $z_min)      //  0  (0,  0,  0)
    ($x_fine_max $y_min      $z_min)      //  1  (10, 0,  0)
    ($x_max      $y_min      $z_min)      //  2  (14, 0,  0)
    ($x_min      $y_fine_max $z_min)      //  3  (0,  6,  0)
    ($x_fine_max $y_fine_max $z_min)      //  4  (10, 6,  0)
    ($x_max      $y_fine_max $z_min)      //  5  (14, 6,  0)
    ($x_min      $y_max      $z_min)      //  6  (0,  10, 0)
    ($x_fine_max $y_max      $z_min)      //  7  (10, 10, 0)
    ($x_max      $y_max      $z_min)      //  8  (14, 10, 0)

    // z = z_fine_max (middle plane)
    ($x_min      $y_min      $z_fine_max) //  9  (0,  0,  8)
    ($x_fine_max $y_min      $z_fine_max) // 10  (10, 0,  8)
    ($x_max      $y_min      $z_fine_max) // 11  (14, 0,  8)
    ($x_min      $y_fine_max $z_fine_max) // 12  (0,  6,  8)
    ($x_fine_max $y_fine_max $z_fine_max) // 13  (10, 6,  8)
    ($x_max      $y_fine_max $z_fine_max) // 14  (14, 6,  8)
    ($x_min      $y_max      $z_fine_max) // 15  (0,  10, 8)
    ($x_fine_max $y_max      $z_fine_max) // 16  (10, 10, 8)
    ($x_max      $y_max      $z_fine_max) // 17  (14, 10, 8)

    // z = z_max (top plane)
    ($x_min      $y_min      $z_max)      // 18  (0,  0,  12)
    ($x_fine_max $y_min      $z_max)      // 19  (10, 0,  12)
    ($x_max      $y_min      $z_max)      // 20  (14, 0,  12)
    ($x_min      $y_fine_max $z_max)      // 21  (0,  6,  12)
    ($x_fine_max $y_fine_max $z_max)      // 22  (10, 6,  12)
    ($x_max      $y_fine_max $z_max)      // 23  (14, 6,  12)
    ($x_min      $y_max      $z_max)      // 24  (0,  10, 12)
    ($x_fine_max $y_max      $z_max)      // 25  (10, 10, 12)
    ($x_max      $y_max      $z_max)      // 26  (14, 10, 12)
);

// ────────────────────────────────────────────────
// BLOCKS with grading
// 2 x-bands × 2 y-bands × 2 z-bands = 8 blocks
// ────────────────────────────────────────────────
blocks
(
    // Lower z (fine): z_min to z_fine_max
    hex ( 0  1  4  3  9 10 13 12) ($nx_fine   $ny_fine   $nz_fine) simpleGrading (1          1          1)
    hex ( 3  4  7  6 12 13 16 15) ($nx_fine   $ny_coarse $nz_fine) simpleGrading (1          $expansion 1)
    hex ( 1  2  5  4 10 11 14 13) ($nx_coarse $ny_fine   $nz_fine) simpleGrading ($expansion 1          1)
    hex ( 4  5  8  7 13 14 17 16) ($nx_coarse $ny_coarse $nz_fine) simpleGrading ($expansion $expansion 1)

    // Upper z (coarse): z_fine_max to z_max
    hex ( 9 10 13 12 18 19 22 21) ($nx_fine   $ny_fine   $nz_coarse) simpleGrading (1          1          $expansion)
    hex (12 13 16 15 21 22 25 24) ($nx_fine   $ny_coarse $nz_coarse) simpleGrading (1          $expansion $expansion)
    hex (10 11 14 13 19 20 23 22) ($nx_coarse $ny_fine   $nz_coarse) simpleGrading ($expansion 1          $expansion)
    hex (13 14 17 16 22 23 26 25) ($nx_coarse $ny_coarse $nz_coarse) simpleGrading ($expansion $expansion $expansion)
);

edges
(
);

boundary
(
    left
    {
        type symmetryPlane;   // x=0 symmetry plane (unchanged)
        faces
        (
            ( 0  9 12  3)
            ( 3 12 15  6)
            ( 9 18 21 12)
            (12 21 24 15)
        );
    }

    front
    {
        type symmetryPlane;   // y=0 symmetry plane — NEW (quarter domain)
        faces
        (
            ( 0  1 10  9)
            ( 1  2 11 10)
            ( 9 10 19 18)
            (10 11 20 19)
        );
    }

    right
    {
        type patch;
        faces
        (
            ( 2 11 14  5)
            ( 5 14 17  8)
            (11 20 23 14)
            (14 23 26 17)
        );
    }

    top
    {
        type patch;
        faces
        (
            (18 19 22 21)
            (21 22 25 24)
            (19 20 23 22)
            (22 23 26 25)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            ( 0  1  4  3)
            ( 3  4  7  6)
            ( 1  2  5  4)
            ( 4  5  8  7)
        );
    }

    back
    {
        type patch;
        faces
        (
            ( 6  7 16 15)
            ( 7  8 17 16)
            (15 16 25 24)
            (16 17 26 25)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
