case_up_half_cube_28/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;  //CrankNicolson 0.9;
}

gradSchemes
{
    default    cellLimited Gauss linear 1.0; // cellMDLimited; Gauss linear;
    grad(U)    cellLimited Gauss linear 1.0;                                                  
}

divSchemes
{
    default         none;

    div(phi,U)        Gauss limitedLinearV 0.5;
    // multivariateSelection keeps species AND enthalpy transport
    // consistent — prevents H2/h drift that accumulates in the
    // closed V-room and shows up as cold spots above the source.
    div(phi,Yi_h)     Gauss multivariateSelection
    {
        H2   limitedLinear01 0.5;
        O2   limitedLinear01 0.5;
        H2O  limitedLinear01 0.5;
        N2   limitedLinear01 0.5;
        h    limitedLinear    0.5;
    };
    div(phi,K)        Gauss limitedLinear 0.5;
    div(phid,p)       Gauss limitedLinear 0.5;
    div(phi,epsilon)  Gauss limitedLinear 0.5;
    div(phi,k)        Gauss limitedLinear 0.5;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected; //Gauss linear limited 1.0;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected; //limited 1.0;
}

fluxRequired
{
    p;
}


// ************************************************************************* //
