case_up_half_cube_28/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    Phi
    {
        $p;
    }

    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;   // relaxed from 1e-8; tighten back if p diverges
        relTol           0;
    }

    pFinal
    {
        $p;
        relTol           0;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;   // relaxed from 1e-8; tighten back if T drifts or species sum errors grow
        relTol          0.0;
        minIter         1;
    }

    "(U|h|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }

}

PIMPLE
{
    momentumPredictor on;
    nOuterCorrectors 5;   // keep at 5: residualControl exits early (~2 iters) when converged, but full 5 needed during ramp-up transients
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;

    // Absolute stopping criteria — PIMPLE outer loop keeps iterating
    // until every field is below its tolerance. Critical for the
    // closed V-room so per-step energy/species errors cannot leak.
    residualControl
    {
        p
        {
            tolerance   1e-4;
            relTol      0.0;
        }
        U
        {
            tolerance   1e-5;
            relTol      0.0;
        }
        h
        {
            tolerance   1e-6;
            relTol      0.0;
        }
        "(H2|O2|H2O|N2)"
        {
            tolerance   1e-6;
            relTol      0.0;
        }
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    equations
    {
        // Non-final PIMPLE outer iterations: under-relax for stability
        "(U|k|epsilon|h|H2|O2|H2O|air|p)"      0.7;
        // Final outer iteration: NO under-relaxation, so discrete
        // energy/momentum/species balances close exactly each step.
        // Previously "h.*" matched hFinal too, leaking enthalpy and
        // causing the slow T drift above the source.
        "(U|k|epsilon|h|H2|O2|H2O|air|p)Final" 1.0;
    }
}
// ************************************************************************* //
