case_up_half_cube_28/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

actions
(
    {
        name    source;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch "nozzle_wall";
        }
    }

    {
        name    source;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            // Source is at the nozzle exit plane at z~1.0 m.
            // z-range widened to ±1 mm for robustness.
            // x/y cover 31.6 mm nozzle half-width (15.8 mm) + ~4 mm margin = 20 mm.
            box (-0.020 -0.020 0.999) (0.020 0.020 1.001);
        }
    }

    {
        name    source;
        type    faceSet;
        action  subset;
        source  normalToFace;
        sourceInfo
        {
            normal (0 0 -1);
            cos    0.95;
        }
    }

    {
        name    nozzle_wall_rest;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            patch "nozzle_wall";
        }
    }

    {
        name    nozzle_wall_rest;
        type    faceSet;
        action  subtract;
        source  faceToFace;
        set     source;
    }
);
